## Real- World Use Case: Small Supermarket Analysis

In [1]:
# Step 1: Import libraries
import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt 
import seaborn as sns 
# Step 2: Ready to analyze!

print("Libraries imported successfully!")

Libraries imported successfully!

In [3]:
# === STEP 1: Import all necessary libraries ===
print(" Setting up our data analysis environment...")

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

print(" All libraries imported successfully!")

 Setting up our data analysis environment...
 All libraries imported successfully!

In [4]:
# === STEP 2: Test that everything works ===
print(f"ðŸ“Š Pandas version: {pd.__version__}")
print(f"ðŸ”¢ Numpy version: {np.__version__}")
print("ðŸŽ¨ Matplotlib and Seaborn are ready for visualization!")

ðŸ“Š Pandas version: 2.2.3
ðŸ”¢ Numpy version: 2.1.3
ðŸŽ¨ Matplotlib and Seaborn are ready for visualization!

In [14]:
# === STEP 3: Create a simple example ===
# Let's create some sample data to prove everything works
sample_data = {
'Product': ['Apples', 'Bananas', 'Oranges', 'Bread', 'Milk'],
'Sales': [150, 200, 120, 300, 250],
'Profit': [45, 80, 36, 90, 75]
}
# Convert to a pandas DataFrame (think of it as a smart table)
df = pd.DataFrame(sample_data)
print("\n Sample supermarket data:")
print(df)
print("\n DataFrame created is successfully ready for analysis!")

 Sample supermarket data:
   Product  Sales  Profit
0   Apples    150      45
1  Bananas    200      80
2  Oranges    120      36
3    Bread    300      90
4     Milk    250      75

 DataFrame created is successfully ready for analysis!

In [15]:
df.head(4)

   Product  Sales  Profit
0   Apples    150      45
1  Bananas    200      80
2  Oranges    120      36
3    Bread    300      90

In [18]:
## mini assignment
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

print("Success! All libraries imported correctly!")

Success! All libraries imported correctly!

In [26]:
sales_data = {'Product': ['Laptop', 'Mobile Phone', 'Pair of jeans', 'Shoes', 'Bag','Books'],
                 'Sales': [25000, 10000,2800,2500,600,500],
                 'Profit': [2000,1800,400,500,200,150]}

df = pd.DataFrame(shopping_list)
print("\n Sales data:")
print(df)
print("\n It was precise but costly shopping!")

 Sales data:
         Product  Sales  Profit
0         Laptop  25000    2000
1   Mobile Phone  10000    1800
2  Pair of jeans   2800     400
3          Shoes   2500     500
4            Bag    600     200
5          Books    500     150

 It was precise but costly shopping!

In [24]:
df.head(3)

         Product  Sales  Profit
0         Laptop  25000    2000
1   Mobile Phone  10000    1800
2  Pair of jeans   2800     400

In [25]:
df.tail(3)

  Product  Sales  Profit
3   Shoes   2500     500
4     Bag    600     200
5   Books    500     150